Tekla Open API Reference for Tekla Structures 2025
BentPlateGeometrySolver.ScaleConeSection Method
 Scale the shape of a conical section.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ConnectiveGeometry ScaleConeSection(
	ConnectiveGeometry geometry,
	GeometrySection conicalSection,
	double scale
)
Public Function ScaleConeSection (
	geometry As ConnectiveGeometry,
	conicalSection As GeometrySection,
	scale As Double
) As ConnectiveGeometry
Parameters
geometry
Type: Tekla.Structures.Model.ConnectiveGeometry
Reference geometry to modify which contains conicalSection.
conicalSection
Type: Tekla.Structures.Model.GeometrySection
The conical geometry section to modify.
scale
Type: System.Double
Scale to apply to the conical section (greater than 0).
Return Value
Type: ConnectiveGeometry
Modified ConnectiveGeometry if command succeeded or geometry otherwise.
Exceptions
Exception | Condition
ConnectiveGeometryException | Thrown if could not modify the geometry.
See Also
Reference
BentPlateGeometrySolver Class
Tekla.Structures.Model Namespace